test/integration/data.containerHostSystem/request-3.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <CreateContainerView xmlns="urn:vim25">
      <_this type="ViewManager">ViewManager</_this>
      <container type="Folder">group-d1</container>
      <type>HostSystem</type>
      <recursive>true</recursive>
    </CreateContainerView>
  </soapenv:Body>
</soapenv:Envelope>
